app/views/search/search.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 5]]
---
			    	<i class="fa fa-heart" aria-hidden="true" ></i>
			    	<%= book.favorites.count %>

SELECT "books".* FROM "books" WHERE (title LIKE '%2%')
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 5]]
---
				<td>
					コメント数：<%= book.book_comments.count %>