app/views/books/index.html.erb

SELECT "books".* FROM "books" WHERE (title LIKE '%22%')
---
					<td>
						コメント数：<%= book.book_comments.count %>