app/views/books/index.html.erb

					<td>
						コメント数：<%= book.book_comments.count %>
---
SELECT "books".* FROM "books" WHERE (title LIKE '%22%')
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]