app/controllers/books_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @book = Book.find(params[:id])
    @user = User.find(current_user.id)

SELECT "books".* FROM "books" WHERE (title LIKE '%22%')
---
  def index
    @books = Book.all